<template>
  <div class="container mx-auto mt-5">
    <h1 class="text-2xl text-center">За Сайта</h1>
    <div class="site-desc">
      <p>
        Представяме {{ SITE_TITLE }}, най-добрият мениджър на пароли за сигурно
        и ефективно управление на пароли. С {{ SITE_TITLE }} можете сигурно да
        съхранявате и управлявате всичките си пароли на едно централно място.
      </p>
      <p>
        Създайте главна парола за сигурен достъп до вашия акаунт и добавете нови
        пароли, редактирайте съществуващите и ги организирайте по категории за
        лесен достъп. Можете също така да генерирате силни, уникални пароли за
        нови акаунти само с едно кликване.
      </p>
      <p>
        {{ SITE_TITLE }} улеснява безопасното споделяне на пароли с вашия
        екип или членове на семейството. Дайте конкретни разрешения на всеки
        потребител, за да контролирате кой може да преглежда, редактира или
        изтрива пароли.
      </p>
      <p>
        С мощно криптиране и разширени функции за сигурност,
        {{ SITE_TITLE }} гарантира, че вашата чувствителна информация винаги е
        безопасна и защитена. Кажете сбогом на главоболията, свързани с
        паролите, и рационализирайте управлението на паролите си с {{ SITE_TITLE }}!
      </p>
    </div>
  </div>
</template>

<script>
import { SITE_TITLE } from "@src/constants";

export default {
  name: "AboutView",
  setup() {
    return { SITE_TITLE };
  },
};
</script>

<style scoped>
.site-desc {
  @apply p-5 mt-5 bg-white text-black rounded border;
}

.site-desc p {
  @apply py-2.5;
}
</style>
